{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing styling, components, hooks, and behaviors.",
  "frontend/index.css": "Global Tailwind base setup defining color tokens, theme variables, and dark-mode variants.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering ValentineLanding with global styles.",
  "frontend/src/components/valentine/CelebrationOverlay.tsx": "Canvas-based celebratory overlay with intensity scaling and reduced-motion fallback.",
  "frontend/src/components/valentine/InevitableNoButton.tsx": "Interactive \"No\" button with dynamic labels and evasive behaviors after several attempts.",
  "frontend/src/components/valentine/noButtonBehaviors.ts": "Defines escalating behavior functions that determine how the No button visually reacts or evades user interaction.",
  "frontend/src/components/valentine/ResponsiveStage.tsx": "Provides responsive bounds and a container ref to children for positioning logic.",
  "frontend/src/components/valentine/useCelebration.ts": "Hook controlling celebration animation timing and reduced-motion behavior based on intensity.",
  "frontend/src/components/valentine/usePrefersReducedMotion.ts": "Hook detecting system-level reduced-motion preference with live updates.",
  "frontend/src/components/valentine/useSafeRandomPosition.ts": "Generates safe, non-overlapping random positions for the No button with optional edge, corner, and repulsion behaviors.",
  "frontend/src/components/valentine/ValentineLanding.tsx": "Main Valentine landing component managing app state, animations, and dynamic teasing messages for the Yes/No interaction.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and status states.",
  "frontend/src/index.css": "Global Tailwind-based styling with Valentine-themed colors, gradients, and animation keyframes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and loading the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current requirements and behavior for a Valentine-themed interactive site with Yes/No flow, images, and feature specifications."
}