{
  "kind": "build_request",
  "title": "Make the 'Think again' loop more playful and add more Valentine images + animations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Extend and amplify the playful, escalating \"Think again\" experience for repeated \"No\" attempts by adding many more varied, teasing feedback lines (beyond the current sets) and ensuring the copy continues to feel fresh over very high attempt counts while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "sure add it , can you continue the \"think again\" and be more playful"
        ]
      },
      "acceptanceCriteria": [
        "After 30+ \"No\" attempts, the feedback text under the question continues to change and remain playful (no short repetitive loop).",
        "The \"No\" button label continues to evolve beyond the current label arrays and includes additional \"think again\"-style variants.",
        "All new user-facing strings are in English."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add one additional celebratory flourish when the user finally clicks \"Yes\" that feels extra rewarding (e.g., a brief 'final give-in' beat with extra sparkles/heart burst), and scale the flourish intensity based on how many \"No\" attempts occurred before \"Yes\" (while still respecting reduced-motion preferences).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "want to try adding one fun flourish to the moment they finally give in and say yes?",
          "sure add it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Yes\" triggers a noticeably enhanced celebratory moment compared to the current baseline.",
        "If the user clicked \"No\" many times before clicking \"Yes\", the celebration feels 'bigger' (e.g., denser particles/longer duration/extra overlay beat), without breaking performance.",
        "When `prefers-reduced-motion` is enabled, the flourish uses a non-motion or minimal-motion alternative (e.g., static burst/quick fade)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add additional Valentine-themed static visual assets (new generated images) and render them in the epilogue, question, and/or success views as decorative accents (stickers/doodles/badges), without routing images through the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "also add more images"
        ]
      },
      "acceptanceCriteria": [
        "New images are added under `frontend/public/assets/generated` and are referenced directly from the frontend via `/assets/generated/...`.",
        "The added images are purely decorative and do not obstruct button interactions or readability on common viewport sizes.",
        "Decorative images adapt gracefully to dark mode (e.g., via opacity/blend/filters) and do not create harsh contrast."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Increase overall playfulness by adding a few more lightweight UI animations/micro-interactions across the epilogue, question, and success views (e.g., subtle sticker bobbing, sparkle twinkles, gentle heading shimmer), while maintaining accessibility and providing reduced-motion-safe alternatives.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "and animations if you can"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 new micro-interactions/animations are visible across the flow (epilogue/question/success), consistent with the existing cute romantic aesthetic.",
        "All added animations are disabled or converted to non-motion alternatives when `prefers-reduced-motion` is enabled.",
        "No new animation causes layout shift that moves the buttons unexpectedly (except the intentional \"No\" evasion logic)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose them instead).",
    "Do not modify any frontend files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Store any newly generated images under `frontend/public/assets/generated` and load them directly from the frontend.",
    "Keep all user-facing text in English.",
    "Respect `prefers-reduced-motion` across any new motion/animation behavior."
  ],
  "nonGoals": [
    "Adding backend persistence, accounts, or analytics for attempts.",
    "Changing authentication (Internet Identity) behavior or adding third-party auth providers.",
    "Introducing routing/multi-page navigation; keep the experience single-page.",
    "Adding real-time or server-driven features."
  ],
  "imageRequirements": {
    "required": [
      "Valentine sticker doodle set (hearts, sparkles, tiny cupid/arrow) (valentine-stickers-set.dim_1024x1024.png)",
      "Hand-drawn heart garland banner (valentine-heart-garland.dim_1600x400.png)",
      "Romantic paper texture background for love note card (valentine-love-note-paper.dim_1600x1200.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}