{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Playful escalating No-loop + richer Valentine visuals and celebrations",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Expand the escalating \"Think again\" loop with far more varied English feedback and evolving \"No\" labels that stay fresh past 30+ attempts.",
      "acceptanceCriteria": [
        "After 30+ \"No\" attempts, the feedback text under the question continues to change and remain playful (no short repetitive loop).",
        "The \"No\" button label continues to evolve beyond the current label arrays and includes additional \"think again\"-style variants.",
        "All new user-facing strings are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/ValentineLanding.tsx",
          "operation": "modify",
          "description": "Replace the current small cyclic feedback arrays with a higher-entropy feedback system (larger pools + template-based combinatorics keyed by attempt count) so messages remain playful and non-repetitive for very high attempt counts, keeping all user-facing strings in English."
        },
        {
          "path": "frontend/src/components/valentine/InevitableNoButton.tsx",
          "operation": "modify",
          "description": "Extend the evolving \"No\" label logic beyond the current arrays using a larger set plus template-based label generation (including more \"think again\"-style variants) so labels continue changing well past 30+ attempts, keeping all user-facing strings in English."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add an extra rewarding \"final give-in\" flourish on Yes that scales with prior No attempts and respects reduced-motion preferences.",
      "acceptanceCriteria": [
        "Clicking \"Yes\" triggers a noticeably enhanced celebratory moment compared to the current baseline.",
        "If the user clicked \"No\" many times before clicking \"Yes\", the celebration feels 'bigger' (e.g., denser particles/longer duration/extra overlay beat), without breaking performance.",
        "When `prefers-reduced-motion` is enabled, the flourish uses a non-motion or minimal-motion alternative (e.g., static burst/quick fade)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/ValentineLanding.tsx",
          "operation": "modify",
          "description": "Pass the final no-attempt count (or a derived intensity value) into the celebration layer on \"Yes\" and add a brief on-screen \"final give-in\" beat in the celebrating/success view (e.g., a short-lived banner/badge) that scales subtly with intensity while remaining reduced-motion-safe."
        },
        {
          "path": "frontend/src/components/valentine/CelebrationOverlay.tsx",
          "operation": "modify",
          "description": "Add props for celebration intensity (derived from the number of prior No attempts) and use them to scale particle density/variety/duration within safe performance bounds; ensure prefers-reduced-motion renders a minimal-motion alternative whose 'bigness' can still scale via static density/opacity/size rather than animation."
        },
        {
          "path": "frontend/src/components/valentine/useCelebration.ts",
          "operation": "modify",
          "description": "Update the celebration hook to accept an intensity input and compute an appropriate active duration and reduced-motion behavior (e.g., shorter, fade-based) while keeping the current prefers-reduced-motion detection."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add new Valentine-themed generated images as decorative accents in the epilogue/question/success views, referenced directly from the frontend and styled to work in dark mode.",
      "acceptanceCriteria": [
        "New images are added under `frontend/public/assets/generated` and are referenced directly from the frontend via `/assets/generated/...`.",
        "The added images are purely decorative and do not obstruct button interactions or readability on common viewport sizes.",
        "Decorative images adapt gracefully to dark mode (e.g., via opacity/blend/filters) and do not create harsh contrast."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/valentine-stickers-set.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated asset file at `frontend/public/assets/generated/valentine-stickers-set.dim_1024x1024.png`."
        },
        {
          "path": "frontend/public/assets/generated/valentine-heart-garland.dim_1600x400.png",
          "operation": "create",
          "description": "Add the generated asset file at `frontend/public/assets/generated/valentine-heart-garland.dim_1600x400.png`."
        },
        {
          "path": "frontend/public/assets/generated/valentine-love-note-paper.dim_1600x1200.png",
          "operation": "create",
          "description": "Add the generated asset file at `frontend/public/assets/generated/valentine-love-note-paper.dim_1600x1200.png`."
        },
        {
          "path": "frontend/src/components/valentine/ValentineLanding.tsx",
          "operation": "modify",
          "description": "Render the new decorative images in the existing epilogue/question/success views (single-page flow) using absolute-positioned, pointer-events-none accents; reference the files `frontend/public/assets/generated/valentine-stickers-set.dim_1024x1024.png`, `frontend/public/assets/generated/valentine-heart-garland.dim_1600x400.png`, and `frontend/public/assets/generated/valentine-love-note-paper.dim_1600x1200.png` directly from the frontend and apply dark-mode-friendly opacity/filters so they don't overpower text or obstruct buttons."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add at least three new cute micro-interactions across epilogue/question/success while staying accessible, reduced-motion-safe, and avoiding layout shifts.",
      "acceptanceCriteria": [
        "At least 3 new micro-interactions/animations are visible across the flow (epilogue/question/success), consistent with the existing cute romantic aesthetic.",
        "All added animations are disabled or converted to non-motion alternatives when `prefers-reduced-motion` is enabled.",
        "No new animation causes layout shift that moves the buttons unexpectedly (except the intentional \"No\" evasion logic)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add new transform-only micro-interaction keyframes/classes (e.g., sticker bobbing, sparkle twinkle, gentle heading shimmer) and ensure they are disabled or reduced to minimal-motion alternatives under `@media (prefers-reduced-motion: reduce)`; keep animations from affecting layout by using transforms/opacity only."
        },
        {
          "path": "frontend/src/components/valentine/ValentineLanding.tsx",
          "operation": "modify",
          "description": "Apply the new micro-interaction classes across epilogue/question/success (e.g., to decorative stickers/garland and a heading accent) while ensuring decorative layers remain pointer-events-none and do not introduce button-moving layout shift."
        }
      ]
    }
  ]
}